{
    "title": "Portfolio",

    "about": {
        "greeting": "Hi, i am Andrey Lapchik",
        "description": "Experienced developer from Riga, Latvia. Passionate about creating user friendly web applications. Eager learner and active participant in tech communities. Seeking opportunities to apply skills and contribute to innovative projects.",
        "speciality": "Full-stack web developer"
    },

    "skills": {
        "1": "Beginner",
        "2": "Intermediate",
        "3": "Experienced"
    },

    "experience": "Since 2021, I've gained programming experience through olympiads, projects, freelancing, and coding challenges. These experiences improved my problem-solving skills and expanded my tech knowledge. I am ready to make an effective contribution to the future of programming.",

    "contact": {
        "email": "Your email",
        "name": "Your name",
        "message": "Your message"
    },

    "ui": {
        "labels": {
            "about": "About",
            "skills": "Skills",
            "development-skills": "Development skills",
            "experience": "Experience",
            "contact": "Contact",
            "contact-form": "Contact me",
            "description": "Description",
            "tech-stack": "Tech stack",
            "development-process": "Development process",
            "links": "Links"
        },
        "buttons": {
            "downloadCV": "Download CV",
            "about": "About",
            "design": "Design",
            "source": "Source",
            "send": "Send"
        },
        "links": {
            "figma-file": "Figma file",
            "source-code": "Source code",
            "live-version": "Live version"
        },
        "alert": {
            "messageSent": {
                "name": "Message sent!",
                "text": "Your message has been sent"
            },
            "messageError": {
                "name": "Error!",
                "text": "Failed to send message"
            }
        }
    },

    "projects": {
        "tasker": {
            "brief-description": "A powerful task management system to boost team productivity",
            "description": "Tasker is a robust task management system designed to streamline collaboration and enhance productivity within teams. Whether you're working on a small project or managing complex workflows across multiple teams, Tasker empowers you to stay organized, prioritize tasks, and track progress with ease.",
            "tech-stack": "Next Js, TypeScript, Nest Js, Zustand, TanStack Query, MySQL, TypeORM, JWT",
            "development-process": "The development of Tasker began with in-depth user research. The backend prioritized scalability, security, and performance, integrating robust algorithms. Simultaneously, UI/UX was designed for simplicity and clarity, ensuring cross-device usability. Agile methodologies guided feature refinement based on feedback, with thorough testing ensuring reliability."
        },
        "lapchess": {
            "brief-description": "Online chess platform where players can play against each other",
            "description": "Lapchess is a comprehensive chess platform designed for both enthusiasts and professionals. Whether you're a beginner looking to learn the basics or a seasoned player looking to master advanced techniques, Lapchess will give you the tools you need to improve your gaming experience.",
            "tech-stack": "React, TypeScript, ReduxToolkit, Express Js, JWT, Socket Io, MongoDB",
            "development-process": "The development of Lapchess started with market research and user feedback to shape its design. Through iterative prototyping and testing, the focus was on refining gameplay and interface elements. Regular feedback sessions ensured a seamless user experience."
        },
        "carmarket": {
            "brief-description": "User-friendly platform for buying and selling cars effortlessly",
            "description": "Discover the ultimate ease of buying and selling cars with Carmarket. Our seamless platform connects buyers and sellers, offering hassle-free browsing and secure transactions. With intuitive search filters and transparent pricing, Carmarket ensures a smooth and efficient experience. Say goodbye to traditional car buying stress with Carmarket.",
            "tech-stack": "React, TypeScript, Zustand, Express Js, JWT, MySQL",
            "development-process": "Carmarket development process begins with thorough planning and design, followed by backend and frontend development. Integration and testing ensure stable functionality before deployment, with ongoing support and maintenance post-launch, including user feedback incorporation for continuous improvement."
        }
    }
}
